Revit 2023 API
RebarContainerItem.BarsOnNormalSide Property
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public bool BarsOnNormalSide { get; set; }
Visual Basic
Public Property BarsOnNormalSide As Boolean
	Get
	Set
Visual C++
public:
property bool BarsOnNormalSide {
	bool get ();
	void set (bool value);
}
Field Value
 True if the bars of rebar set are on the same side of the rebar plane indicated by the normal, and false if the bars are on the opposite side.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace